doc/s-sql-t.org
#+TITLE: S-SQL Examples T
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* [[file:s-sql-examples.org][S-SQL Examples Home Page]]
| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* Threads
  :PROPERTIES:
  :CUSTOM_ID: threads
  :END:
While postmodern is generally thread-safe, it is up to the developer to pay attention and remember that postgresql may be spinning off processes at the same time that you are creating threads in your application.

Something like taking from the postmodern/tests.lisp:
#+begin_src lisp
(defclass test-data ()
  ((id :col-type serial :initarg :id :accessor test-id)
   (a :col-type (or (varchar 100) db-null) :initarg :a :accessor test-a)
   (b :col-type boolean :col-default nil :initarg :b :accessor test-b)
   (c :col-type integer :col-default 0 :initarg :c :accessor test-c))
  (:metaclass dao-class)
  (:table-name dao-test)
  (:keys id))

(execute (dao-table-definition 'test-data))

(defvar *dao-update-lock* (bt:make-lock))

(let ((item (make-instance 'test-data :a "SC" :b t :c 0)))
  (with-test-connection (save-dao item))
  (let ((id (test-id item)))
    (loop for x from 1 to 50 do
          (bt:make-thread
           (lambda () (with-test-connection
                       (loop repeat 1000 do (bt:with-lock-held (*dao-update-lock*)
                                                               (incf (test-c item) 1))
                             (save-dao item))
                       (loop repeat 1000 do (bt:with-lock-held (*dao-update-lock*)
                                                               (decf (test-c item) 1))
                             (save-dao item))))))

    (with-test-connection
     (describe (get-dao 'test-data id)))))

#+end_src

may return to your control before all the processes are done. As a result, if you check for value of:
#+begin_src lisp
 (test-c (get-dao 'dao-test 1))
#+end_src
when the lisp code returns, you may be surprised that the answer is not 0. Check a few seconds, later and it may be a different number. If you call
#+begin_src lisp
(pomo:list-connections)
#+end_src
or
#+begin_src lisp
(query (:select '* :from 'pg-stat-activity))
#+end_src
you may notice that there are still outstanding connection - postgresql is still working its way through the processes you just created and it will get through all of them and you will notice that the value has been finally incremented and decremented down to 0.

* Time Functions (now, current-timestamp, current-date, date-trunc, date-part)
  :PROPERTIES:
  :CUSTOM_ID: time-functions
  :END:
** Without using local-time or simple-date
  :PROPERTIES:
  :CUSTOM_ID: vanilla-time-functions
  :END:
*** Now
#+begin_src lisp
  (query (:select (:now)) :single)

  3909564984
#+end_src
*** Current-Timestamp
#+begin_src lisp
  (query (:select (:current-timestamp)) :single)

  3909564895
#+end_src
*** Current-Date
#+begin_src lisp
  (query (:select (:current-date)) :single)

  3909513600
#+end_src
*** Date-Trunc
#+begin_src lisp
  (query (:select (:date-trunc "minute" (:now))) :single)

  3909566160
#+end_src

*** Date-Part
The date-part function may return a double-float, regardless of whether you are using s-sql or raw sql.
#+begin_src lisp
  (query (:select (:date-part "year" (:now)))
         :single)

  2023.0d0
#+end_src
