doc/s-sql-t.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:43 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples T</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples T</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org668248c">S-SQL Examples Home Page</a></li>
<li><a href="#threads">Threads</a></li>
<li><a href="#time-functions">Time Functions (now, current-timestamp, current-date, date-trunc, date-part)</a>
<ul>
<li><a href="#vanilla-time-functions">Without using local-time or simple-date</a>
<ul>
<li><a href="#orge6009ad">Now</a></li>
<li><a href="#org96034c2">Current-Timestamp</a></li>
<li><a href="#org241d939">Current-Date</a></li>
<li><a href="#orgac5551a">Date-Trunc</a></li>
<li><a href="#org61ea9f7">Date-Part</a></li>
<li><a href="#orgefad9ee">Age</a></li>
</ul>
</li>
<li><a href="#local-time-time-functions">Using Local-time library (recommended)</a>
<ul>
<li><a href="#org0135d0d">Now</a></li>
<li><a href="#org4c23c3d">Current-Timestamp</a></li>
<li><a href="#org6dcba40">Current-Date</a></li>
<li><a href="#org2cdba64">Date-trunc</a></li>
<li><a href="#org7b93223">Date-part</a></li>
<li><a href="#org47f6c81">Age</a></li>
<li><a href="#org562c8af">Misc</a></li>
</ul>
</li>
<li><a href="#simple-date-time-functions">Simple-date library</a>
<ul>
<li><a href="#org293d874">Now</a></li>
<li><a href="#org9336ddb">Current-Timestamp</a></li>
<li><a href="#orgcac7956">Current-Date</a></li>
<li><a href="#org54822d9">Date-Trunc</a></li>
<li><a href="#orgbdfe2e1">Date-Part</a></li>
<li><a href="#org4833bc9">Age</a></li>
<li><a href="#orgb7151e5">Misc</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#to-tsquery">To-Tsquery, To-Tsvector</a></li>
<li><a href="#truncate">Truncate</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org668248c" class="outline-2">
<h2 id="org668248c"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org668248c">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-threads" class="outline-2">
<h2 id="threads">Threads</h2>
<div class="outline-text-2" id="text-threads">
<p>
While postmodern is generally thread-safe, it is up to the developer to pay attention and remember that postgresql may be spinning off processes at the same time that you are creating threads in your application.
</p>

<p>
Something like taking from the postmodern/tests.lisp:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defclass</span> <span class="org-type">test-data</span> ()
  ((id <span class="org-builtin">:col-type</span> serial <span class="org-builtin">:initarg</span> <span class="org-builtin">:id</span> <span class="org-builtin">:accessor</span> test-id)
   (a <span class="org-builtin">:col-type</span> (or (varchar 100) db-null) <span class="org-builtin">:initarg</span> <span class="org-builtin">:a</span> <span class="org-builtin">:accessor</span> test-a)
   (b <span class="org-builtin">:col-type</span> boolean <span class="org-builtin">:col-default</span> nil <span class="org-builtin">:initarg</span> <span class="org-builtin">:b</span> <span class="org-builtin">:accessor</span> test-b)
   (c <span class="org-builtin">:col-type</span> integer <span class="org-builtin">:col-default</span> 0 <span class="org-builtin">:initarg</span> <span class="org-builtin">:c</span> <span class="org-builtin">:accessor</span> test-c))
  (<span class="org-builtin">:metaclass</span> dao-class)
  (<span class="org-builtin">:table-name</span> dao-test)
  (<span class="org-builtin">:keys</span> id))

(execute (dao-table-definition 'test-data))

(<span class="org-keyword">defvar</span> <span class="org-variable-name">*dao-update-lock*</span> (bt:make-lock))

(<span class="org-keyword">let</span> ((item (make-instance 'test-data <span class="org-builtin">:a</span> <span class="org-string">"SC"</span> <span class="org-builtin">:b</span> t <span class="org-builtin">:c</span> 0)))
  (<span class="org-keyword">with-test-connection</span> (save-dao item))
  (<span class="org-keyword">let</span> ((id (test-id item)))
    (<span class="org-keyword">loop</span> for x from 1 to 50 do
          (bt:make-thread
           (<span class="org-keyword">lambda</span> () (<span class="org-keyword">with-test-connection</span>
                       (<span class="org-keyword">loop</span> repeat 1000 do (<span class="org-keyword">bt:with-lock-held</span> (*dao-update-lock*)
                                                               (incf (test-c item) 1))
                             (save-dao item))
                       (<span class="org-keyword">loop</span> repeat 1000 do (<span class="org-keyword">bt:with-lock-held</span> (*dao-update-lock*)
                                                               (decf (test-c item) 1))
                             (save-dao item))))))

    (<span class="org-keyword">with-test-connection</span>
     (describe (get-dao 'test-data id)))))

</pre>
</div>

<p>
may return to your control before all the processes are done. As a result, if you check for value of:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(test-c (get-dao 'dao-test 1))
</pre>
</div>
<p>
when the lisp code returns, you may be surprised that the answer is not 0. Check a few seconds, later and it may be a different number. If you call
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:list-connections)
</pre>
</div>
<p>
or
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'pg-stat-activity))
</pre>
</div>
<p>
you may notice that there are still outstanding connection - postgresql is still working its way through the processes you just created and it will get through all of them and you will notice that the value has been finally incremented and decremented down to 0.
</p>
</div>
</div>

<div id="outline-container-time-functions" class="outline-2">
<h2 id="time-functions">Time Functions (now, current-timestamp, current-date, date-trunc, date-part)</h2>
<div class="outline-text-2" id="text-time-functions">
</div>
<div id="outline-container-vanilla-time-functions" class="outline-3">
<h3 id="vanilla-time-functions">Without using local-time or simple-date</h3>
<div class="outline-text-3" id="text-vanilla-time-functions">
</div>
