doc/s-sql-t.org
*** Age
Postgresql has an Age function which generates an interval. A simple example would be:
#+begin_src lisp
  (query "SELECT current_date,
         AGE(timestamp '2000-01-01')")

  ((3909513600 ((:MONTHS 286) (:DAYS 20) (:SECONDS 0) (:USECONDS 0))))
#+end_src
** Using Local-time library (recommended)
  :PROPERTIES:
  :CUSTOM_ID: local-time-time-functions
  :END:
To use local-time load cl-postgres+local-time and then set the appropriate readers. For example:
#+begin_src lisp
  (ql:quickload :cl-postgres+local-time)
  (local-time:set-local-time-cl-postgres-readers)
#+end_src
*** Now
#+begin_src lisp
  (query (:select (:now)) :single)

  @2023-11-21T09:18:50.623000-05:00

  (query (:select (:to-char (:now) "DY (Day), Mon (month)")) :single)
  "TUE (Tuesday  ), Nov (november )"
#+end_src
*** Current-Timestamp
#+begin_src lisp
  (query (:select (:current-timestamp)) :single)

  @2023-11-21T09:20:07.254268-05:00
#+end_src
*** Current-Date
#+begin_src lisp
      (query (:select (:current-date)) :single)

      @2023-11-20T19:00:00.000000-05:00

      (query (:select (:current-date) (:type "now" :time)))

      ((@2023-11-20T19:00:00.000000-05:00 @2000-03-01T09:21:15.756191-05:00))

      (query (:select (:to-char (:current-date) "YYYY-MM-DD HH24:MI:SS"))
             :single)

      "2023-11-21 00:00:00"

      (query (:select (:to-char (:current-date) "YYYY-MM-DD"))
             :single)

      "2023-11-21"

#+end_src

*** Date-trunc
#+begin_src lisp
(query (:select (:date-trunc "minute" (:now))) :single)

@2023-11-21T09:31:00.000000-05:00
#+end_src
*** Date-part
The date-part function may return a double-float, regardless of whether you are using s-sql or raw sql.
#+begin_src lisp
  (query (:select (:date-part "year" (:now)))
        :single)

  2023.0d0
#+end_src
*** Age
Local-Time does not support intervals, so you could not use the Postgresql Age function with the local-time adjusted readtable.
*** Misc
#+begin_src lisp
    (query (:select (:to-char
                   (:type "yesterday" :timestamp)
                   "FMMonth FMDDth"))
         :single)

  "November 20th"
#+end_src
** Simple-date library
  :PROPERTIES:
  :CUSTOM_ID: simple-date-time-functions
  :END:
To use simple-date with Postmodern, load the simple-date/postgres-glue library and reset the sql readtable. For example:
#+begin_src lisp
  (ql:quickload :simple-date/postgres-glue)

(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
            simple-date-cl-postgres-glue:*simple-date-sql-readtable*))
#+end_src
*** Now
#+begin_src lisp
    (query (:select (:now)) :single)

  #<SIMPLE-DATE:TIMESTAMP 21-11-2023T14:40:08,271>
#+end_src
*** Current-Timestamp
#+begin_src lisp
  (query (:select (:current-timestamp)) :single)

#<SIMPLE-DATE:TIMESTAMP 21-11-2023T14:40:59,025>
#+end_src
*** Current-Date
#+begin_src lisp
          (query (:select (:current-date)) :single)

        #<SIMPLE-DATE:DATE 21-11-2023>

         (query (:select (:current-date) (:type "now" :time)))

    ((#<SIMPLE-DATE:DATE 21-11-2023> #<SIMPLE-DATE:TIME-OF-DAY 14:42:59.149618>))

      (query (:select (:to-char (:current-date) "YYYY-MM-DD HH24:MI:SS"))
               :single)

  "2023-11-21 00:00:00"

    (query (:select (:to-char (:current-date) "YYYY-MM-DD"))
             :single)
"2023-11-21"

#+end_src
*** Date-Trunc
#+begin_src lisp
    (query (:select (:date-trunc "minute" (:now)))
           :single)

  #<SIMPLE-DATE:TIMESTAMP 21-11-2023T14:41:00>
#+end_src

*** Date-Part
The date-part function may return a double-float, regardless of whether you are using s-sql or raw sql.
#+begin_src lisp
  (query (:select (:date-part "year" (:now)))
         :single)

2023.0d0
#+end_src
#+begin_src lisp
(query (:select 'current-time (:type "now" :time)))
#+end_src
