doc/s-sql-t.html
<div id="outline-container-orge6009ad" class="outline-4">
<h4 id="orge6009ad">Now</h4>
<div class="outline-text-4" id="text-orge6009ad">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:now</span>)) <span class="org-builtin">:single</span>)

3909564984
</pre>
</div>
</div>
</div>
<div id="outline-container-org96034c2" class="outline-4">
<h4 id="org96034c2">Current-Timestamp</h4>
<div class="outline-text-4" id="text-org96034c2">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-timestamp</span>)) <span class="org-builtin">:single</span>)

3909564895
</pre>
</div>
</div>
</div>
<div id="outline-container-org241d939" class="outline-4">
<h4 id="org241d939">Current-Date</h4>
<div class="outline-text-4" id="text-org241d939">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-date</span>)) <span class="org-builtin">:single</span>)

3909513600
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac5551a" class="outline-4">
<h4 id="orgac5551a">Date-Trunc</h4>
<div class="outline-text-4" id="text-orgac5551a">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:date-trunc</span> <span class="org-string">"minute"</span> (<span class="org-builtin">:now</span>))) <span class="org-builtin">:single</span>)

3909566160
</pre>
</div>
</div>
</div>

<div id="outline-container-org61ea9f7" class="outline-4">
<h4 id="org61ea9f7">Date-Part</h4>
<div class="outline-text-4" id="text-org61ea9f7">
<p>
The date-part function may return a double-float, regardless of whether you are using s-sql or raw sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:date-part</span> <span class="org-string">"year"</span> (<span class="org-builtin">:now</span>)))
       <span class="org-builtin">:single</span>)

2023.0d0
</pre>
</div>
</div>
</div>
<div id="outline-container-orgefad9ee" class="outline-4">
<h4 id="orgefad9ee">Age</h4>
<div class="outline-text-4" id="text-orgefad9ee">
<p>
Postgresql has an Age function which generates an interval. A simple example would be:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"SELECT current_date,</span>
<span class="org-string">       AGE(timestamp '2000-01-01')"</span>)

((3909513600 ((<span class="org-builtin">:MONTHS</span> 286) (<span class="org-builtin">:DAYS</span> 20) (<span class="org-builtin">:SECONDS</span> 0) (<span class="org-builtin">:USECONDS</span> 0))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-local-time-time-functions" class="outline-3">
<h3 id="local-time-time-functions">Using Local-time library (recommended)</h3>
<div class="outline-text-3" id="text-local-time-time-functions">
<p>
To use local-time load cl-postgres+local-time and then set the appropriate readers. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload <span class="org-builtin">:cl-postgres+local-time</span>)
(local-time:set-local-time-cl-postgres-readers)
</pre>
</div>
</div>
<div id="outline-container-org0135d0d" class="outline-4">
<h4 id="org0135d0d">Now</h4>
<div class="outline-text-4" id="text-org0135d0d">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:now</span>)) <span class="org-builtin">:single</span>)

@2023-11-21T09:18:50.623000-05:00

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span> (<span class="org-builtin">:now</span>) <span class="org-string">"DY (Day), Mon (month)"</span>)) <span class="org-builtin">:single</span>)
<span class="org-string">"TUE (Tuesday  ), Nov (november )"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c23c3d" class="outline-4">
<h4 id="org4c23c3d">Current-Timestamp</h4>
<div class="outline-text-4" id="text-org4c23c3d">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-timestamp</span>)) <span class="org-builtin">:single</span>)

@2023-11-21T09:20:07.254268-05:00
</pre>
</div>
</div>
</div>
<div id="outline-container-org6dcba40" class="outline-4">
<h4 id="org6dcba40">Current-Date</h4>
<div class="outline-text-4" id="text-org6dcba40">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-date</span>)) <span class="org-builtin">:single</span>)

@2023-11-20T19:00:00.000000-05:00

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-date</span>) (<span class="org-builtin">:type</span> <span class="org-string">"now"</span> <span class="org-builtin">:time</span>)))

((@2023-11-20T19:00:00.000000-05:00 @2000-03-01T09:21:15.756191-05:00))

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span> (<span class="org-builtin">:current-date</span>) <span class="org-string">"YYYY-MM-DD HH24:MI:SS"</span>))
       <span class="org-builtin">:single</span>)

<span class="org-string">"2023-11-21 00:00:00"</span>

(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span> (<span class="org-builtin">:current-date</span>) <span class="org-string">"YYYY-MM-DD"</span>))
       <span class="org-builtin">:single</span>)

<span class="org-string">"2023-11-21"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org2cdba64" class="outline-4">
<h4 id="org2cdba64">Date-trunc</h4>
<div class="outline-text-4" id="text-org2cdba64">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:date-trunc</span> <span class="org-string">"minute"</span> (<span class="org-builtin">:now</span>))) <span class="org-builtin">:single</span>)

@2023-11-21T09:31:00.000000-05:00
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b93223" class="outline-4">
<h4 id="org7b93223">Date-part</h4>
<div class="outline-text-4" id="text-org7b93223">
<p>
The date-part function may return a double-float, regardless of whether you are using s-sql or raw sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:date-part</span> <span class="org-string">"year"</span> (<span class="org-builtin">:now</span>)))
      <span class="org-builtin">:single</span>)

2023.0d0
</pre>
</div>
</div>
</div>
<div id="outline-container-org47f6c81" class="outline-4">
<h4 id="org47f6c81">Age</h4>
<div class="outline-text-4" id="text-org47f6c81">
<p>
Local-Time does not support intervals, so you could not use the Postgresql Age function with the local-time adjusted readtable.
</p>
</div>
</div>
<div id="outline-container-org562c8af" class="outline-4">
<h4 id="org562c8af">Misc</h4>
<div class="outline-text-4" id="text-org562c8af">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span>
                 (<span class="org-builtin">:type</span> <span class="org-string">"yesterday"</span> <span class="org-builtin">:timestamp</span>)
                 <span class="org-string">"FMMonth FMDDth"</span>))
       <span class="org-builtin">:single</span>)

<span class="org-string">"November 20th"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-simple-date-time-functions" class="outline-3">
<h3 id="simple-date-time-functions">Simple-date library</h3>
<div class="outline-text-3" id="text-simple-date-time-functions">
<p>
To use simple-date with Postmodern, load the simple-date/postgres-glue library and reset the sql readtable. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (ql:quickload <span class="org-builtin">:simple-date/postgres-glue</span>)

(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
            simple-date-cl-postgres-glue:*simple-date-sql-readtable*))
</pre>
</div>
</div>
<div id="outline-container-org293d874" class="outline-4">
<h4 id="org293d874">Now</h4>
<div class="outline-text-4" id="text-org293d874">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:now</span>)) <span class="org-builtin">:single</span>)

#&lt;SIMPLE-DATE:TIMESTAMP 21-11-2023T14:40:08,271&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org9336ddb" class="outline-4">
<h4 id="org9336ddb">Current-Timestamp</h4>
<div class="outline-text-4" id="text-org9336ddb">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-timestamp</span>)) <span class="org-builtin">:single</span>)

#&lt;SIMPLE-DATE:TIMESTAMP 21-11-2023T14:40:59,025&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcac7956" class="outline-4">
<h4 id="orgcac7956">Current-Date</h4>
<div class="outline-text-4" id="text-orgcac7956">
<div class="org-src-container">
<pre class="src src-lisp">          (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-date</span>)) <span class="org-builtin">:single</span>)

        #&lt;SIMPLE-DATE:DATE 21-11-2023&gt;

         (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:current-date</span>) (<span class="org-builtin">:type</span> <span class="org-string">"now"</span> <span class="org-builtin">:time</span>)))

    ((#&lt;SIMPLE-DATE:DATE 21-11-2023&gt; #&lt;SIMPLE-DATE:TIME-OF-DAY 14:42:59.149618&gt;))

      (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span> (<span class="org-builtin">:current-date</span>) <span class="org-string">"YYYY-MM-DD HH24:MI:SS"</span>))
               <span class="org-builtin">:single</span>)

  <span class="org-string">"2023-11-21 00:00:00"</span>

    (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span> (<span class="org-builtin">:current-date</span>) <span class="org-string">"YYYY-MM-DD"</span>))
             <span class="org-builtin">:single</span>)
<span class="org-string">"2023-11-21"</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org54822d9" class="outline-4">
<h4 id="org54822d9">Date-Trunc</h4>
<div class="outline-text-4" id="text-org54822d9">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:date-trunc</span> <span class="org-string">"minute"</span> (<span class="org-builtin">:now</span>)))
         <span class="org-builtin">:single</span>)

#&lt;SIMPLE-DATE:TIMESTAMP 21-11-2023T14:41:00&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbdfe2e1" class="outline-4">
<h4 id="orgbdfe2e1">Date-Part</h4>
<div class="outline-text-4" id="text-orgbdfe2e1">
<p>
The date-part function may return a double-float, regardless of whether you are using s-sql or raw sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:date-part</span> <span class="org-string">"year"</span> (<span class="org-builtin">:now</span>)))
         <span class="org-builtin">:single</span>)

2023.0d0
</pre>
</div>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'current-time (<span class="org-builtin">:type</span> <span class="org-string">"now"</span> <span class="org-builtin">:time</span>)))
</pre>
</div>
</div>
</div>
