doc/s-sql-t.org
*** Age
Simple-date does support intervals, so you can use the Postgresql Age function:
#+begin_src lisp
  (query "SELECT current_date,
       AGE(timestamp '2000-01-01')")
((#<SIMPLE-DATE:DATE 21-11-2023> #<SIMPLE-DATE:INTERVAL P23Y10M20D>))

#+end_src
*** Misc
#+begin_src lisp
    (query (:select (:to-char
                   (:type "yesterday" :timestamp)
                   "FMMonth FMDDth"))
         :single)

  "November 20th"
#+end_src
* To-Tsquery, To-Tsvector
  :PROPERTIES:
  :CUSTOM_ID: to-tsquery
  :END:
  First as used in creating a table:
  #+begin_src lisp
    (query (:create-table 't10
                          ((title :type (or text db-null))
                           (body :type (or text db-null))
                           (tsv :type (or tsvector db-null)
                                :generated-always
                                (:to-tsvector "english" 'body)))))
  #+end_src
  Now in a where clause in a selection query, either specifying the language or not specifying the language.:
  #+begin_src lisp
    (query (:select 'title
                   :from 'pgweb
                   :where (:@@ (:to-tsvector "english" 'body)
                               (:to-tsquery "english" "friend"))))

        (query (:select 'title
                   :from 'pgweb
                   :where (:@@ (:to-tsvector 'body)
                               (:to-tsquery "friend"))))
  #+end_src
  S-SQL does not currently have tsquery operators, so tsquery expressions have to be included in the search term:
  #+begin_src lisp
    (query (:select 'id 'body :from 't12
                              :where (:@@ (:to-tsvector 'body)
                                          (:to-tsquery "depend | loud"))))
  #+end_src
  Indexing the tsv column:
  #+begin_src lisp
    (query (:create-index 'textsearch11-idx :on 't11 :using 'gin :fields 'tsv))
  #+end_src

* Truncate
  :PROPERTIES:
  :CUSTOM_ID: truncate
  :END:
This query sql-op takes one or more table names and will truncate those tables (deleting all the rows. The following keyword parameters are optionally allowed and must be in this order.
-  :only will truncate only this table and not descendent tables.
-  :restart-identity will restart any sequences owned by the table.
-  :continue-identity will continue sequences owned by the table.
-  :cascade will cascade the truncation through tables using foreign keys.
  #+begin_src lisp
    (query (:truncate 'bigtable 'fattable))
    (query (:truncate 'bigtable 'fattable :only))
    (query (:truncate 'bigtable 'fattable :only :continue-identity))
    (query (:truncate 'bigtable 'fattable :only :restart-identity))
    (query (:truncate 'bigtable 'fattable :only :restart-identity :cascade ))
    (query (:truncate 'bigtable 'fattable :only :continue-identity :cascade ))
    (query (:truncate 'bigtable 'fattable :continue-identity :cascade ))
  #+end_src
