doc/s-sql-t.html
<div id="outline-container-org4833bc9" class="outline-4">
<h4 id="org4833bc9">Age</h4>
<div class="outline-text-4" id="text-org4833bc9">
<p>
Simple-date does support intervals, so you can use the Postgresql Age function:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query <span class="org-string">"SELECT current_date,</span>
<span class="org-string">       AGE(timestamp '2000-01-01')"</span>)
((#&lt;SIMPLE-DATE:DATE 21-11-2023&gt; #&lt;SIMPLE-DATE:INTERVAL P23Y10M20D&gt;))

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb7151e5" class="outline-4">
<h4 id="orgb7151e5">Misc</h4>
<div class="outline-text-4" id="text-orgb7151e5">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:to-char</span>
                 (<span class="org-builtin">:type</span> <span class="org-string">"yesterday"</span> <span class="org-builtin">:timestamp</span>)
                 <span class="org-string">"FMMonth FMDDth"</span>))
       <span class="org-builtin">:single</span>)

<span class="org-string">"November 20th"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-to-tsquery" class="outline-2">
<h2 id="to-tsquery">To-Tsquery, To-Tsvector</h2>
<div class="outline-text-2" id="text-to-tsquery">
<p>
First as used in creating a table:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-table</span> 't10
                      ((title <span class="org-builtin">:type</span> (or text db-null))
                       (body <span class="org-builtin">:type</span> (or text db-null))
                       (tsv <span class="org-builtin">:type</span> (or tsvector db-null)
                            <span class="org-builtin">:generated-always</span>
                            (<span class="org-builtin">:to-tsvector</span> <span class="org-string">"english"</span> 'body)))))
</pre>
</div>
<p>
Now in a where clause in a selection query, either specifying the language or not specifying the language.:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'title
               <span class="org-builtin">:from</span> 'pgweb
               <span class="org-builtin">:where</span> (<span class="org-builtin">:@@</span> (<span class="org-builtin">:to-tsvector</span> <span class="org-string">"english"</span> 'body)
                           (<span class="org-builtin">:to-tsquery</span> <span class="org-string">"english"</span> <span class="org-string">"friend"</span>))))

    (query (<span class="org-builtin">:select</span> 'title
               <span class="org-builtin">:from</span> 'pgweb
               <span class="org-builtin">:where</span> (<span class="org-builtin">:@@</span> (<span class="org-builtin">:to-tsvector</span> 'body)
                           (<span class="org-builtin">:to-tsquery</span> <span class="org-string">"friend"</span>))))
</pre>
</div>
<p>
S-SQL does not currently have tsquery operators, so tsquery expressions have to be included in the search term:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'body <span class="org-builtin">:from</span> 't12
                          <span class="org-builtin">:where</span> (<span class="org-builtin">:@@</span> (<span class="org-builtin">:to-tsvector</span> 'body)
                                      (<span class="org-builtin">:to-tsquery</span> <span class="org-string">"depend | loud"</span>))))
</pre>
</div>
<p>
Indexing the tsv column:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-index</span> 'textsearch11-idx <span class="org-builtin">:on</span> 't11 <span class="org-builtin">:using</span> 'gin <span class="org-builtin">:fields</span> 'tsv))
</pre>
</div>
</div>
</div>

<div id="outline-container-truncate" class="outline-2">
<h2 id="truncate">Truncate</h2>
<div class="outline-text-2" id="text-truncate">
<p>
This query sql-op takes one or more table names and will truncate those tables (deleting all the rows. The following keyword parameters are optionally allowed and must be in this order.
</p>
<ul class="org-ul">
<li>:only will truncate only this table and not descendent tables.</li>
<li>:restart-identity will restart any sequences owned by the table.</li>
<li>:continue-identity will continue sequences owned by the table.</li>
<li><p>
:cascade will cascade the truncation through tables using foreign keys.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable))
(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable <span class="org-builtin">:only</span>))
(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable <span class="org-builtin">:only</span> <span class="org-builtin">:continue-identity</span>))
(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable <span class="org-builtin">:only</span> <span class="org-builtin">:restart-identity</span>))
(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable <span class="org-builtin">:only</span> <span class="org-builtin">:restart-identity</span> <span class="org-builtin">:cascade</span> ))
(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable <span class="org-builtin">:only</span> <span class="org-builtin">:continue-identity</span> <span class="org-builtin">:cascade</span> ))
(query (<span class="org-builtin">:truncate</span> 'bigtable 'fattable <span class="org-builtin">:continue-identity</span> <span class="org-builtin">:cascade</span> ))
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</body>
</html>